[
    {
        "description": "Fabrice (Fabrice Luchini) is an average office worker with a sub-par family life, but his obsession with French singer Jean-Philippe (Johnny Hallyday) knows no bounds. Then one day he's knocked unconscious, and wakes up to discover that he is in an alternate universe where Jean-Philippe never achieved fame and fortune -- in fact, Fabrice runs into the singer working in a bowling alley. Despite the odds against them, Fabrice dedicates himself to making Jean-Philippe the star he knows he is.",
        "language": "en",
        "run_time": 5640,
        "title": "Jean-Philippe",
        "tms_id": "MV001901390000",
        "year": 2006
    },
    {
        "description": "Two bumbling detectives have to protect a high-end escort who withholds key evidence to a government cover-up from a ruthless assassin.",
        "language": "en",
        "run_time": 6120,
        "title": "Cat Run",
        "tms_id": "MV003486890000",
        "year": 2011
    },
    {
        "description": "A Korean family of practitioners of tae kwon-do moves to Thailand to set up a gym.",
        "language": "en",
        "run_time": null,
        "title": "The Kick",
        "tms_id": "MV003861710000",
        "year": 2011
    },
    {
        "description": "Just as underground bare-knuckle fighter Philo Beddoe (Clint Eastwood) is about to retire, he is asked by the Mafia to fight East Coast champion Jack Wilson (William Smith), who has been crippling opponents in his victories. To get Philo to agree to fight, the Mafia kidnaps his old love, Lynn Halsey-Taylor (Sondra Locke). When Jack finds out, he agrees to help Philo rescue Lynn. Afterward, Philo and Jack decide to fight anyway to settle who is the better brawler.",
        "language": "en",
        "run_time": 6960,
        "title": "Any Which Way You Can",
        "tms_id": "MV000000580000",
        "year": 1980
    },
    {
        "description": "A notorious bandit tracks the outlaws who robbed a bank.",
        "language": "en",
        "run_time": 5760,
        "title": "The Righteous and the Wicked",
        "tms_id": "MV003759150000",
        "year": 2010
    },
    {
        "description": "The struggle and triumph of black surfers serves as a palette to show the complexity of race relations in America .",
        "language": "en",
        "run_time": 4680,
        "title": "White Wash",
        "tms_id": "MV003733850000",
        "year": 2011
    },
    {
        "description": "Ex-smuggler Chris Farraday (Mark Wahlberg) gave up his criminal ways long ago. But, he's forced back into the game after his brother-in-law, Andy (Caleb Landry Jones), botches a drug deal for a crime lord (Giovanni Ribisi), leaving Chris to settle the debt. With the help of his best friend (Ben Foster), Chris assembles a team to run to Panama to retrieve a fortune in counterfeit bills. When things go awry, Chris must call on his rusty skills to complete the task before his family pays the price.",
        "language": "en",
        "run_time": 6600,
        "title": "Contraband",
        "tms_id": "MV003681250000",
        "year": 2012
    },
    {
        "description": "Victor (Johnny Depp) and Victoria's (Emily Watson) families have arranged their marriage. Though they like each other, Victor is nervous about the ceremony. While he's in a forest practicing his lines for the wedding, a tree branch becomes a hand that drags him to the land of the dead. It belongs to Emily, who was murdered after eloping with her love and wants to marry Victor. Victor must get back aboveground before Victoria marries the villainous Barkis Bittern (Richard E. Grant).",
        "language": "en",
        "run_time": 4560,
        "title": "Tim Burton's Corpse Bride",
        "tms_id": "MV001621000000",
        "year": 2005
    },
    {
        "description": "While staying with his uncle for the summer, a troubled teen (Anton Yelchin) partners with an aspiring doctor (Eva Amurri) to sell marijuana.",
        "language": "en",
        "run_time": 5700,
        "title": "Middle of Nowhere",
        "tms_id": "MV003234530000",
        "year": 2008
    },
    {
        "description": "Professional surfer Kelly Slater and his friends search for the best waves at the surf site Teahupo'o.",
        "language": "en",
        "run_time": 2700,
        "title": "The Ultimate Wave Tahiti",
        "tms_id": "MV002737690000",
        "year": 2010
    },
    {
        "description": "A reclusive lawman (Nicolas Cage) travels to a secluded island to search for a girl who has gone missing. Once there, he discovers sinister forces at work among the island's secretive residents, including strange sexual rituals, a harvest festival and possible human sacrifice.",
        "language": "en",
        "run_time": 6180,
        "title": "The Wicker Man",
        "tms_id": "MV001797590000",
        "year": 2006
    },
    {
        "description": "A young boy believes that there is a monster in his bedroom closet.",
        "language": "en",
        "run_time": 5580,
        "title": "Jake's Closet",
        "tms_id": "MV002767850000",
        "year": 2007
    },
    {
        "description": "A manned space flight from Venus crash lands in the Mediterranean, losing its most precious cargo: reptilian eggs from the planet's surface. They come into the possession of an Italian zoologist (Frank Puglia), who watches as one hatches to reveal a rapidly-growing monster. His American granddaughter, Marisa (Joan Taylor), and returned astronaut Calder (William Hopper) must battle with the American and Italian military to corral the creature before it destroys everything in its path.",
        "language": "en",
        "run_time": 4920,
        "title": "20 Million Miles to Earth",
        "tms_id": "MV003409080000",
        "year": 1957
    },
    {
        "description": "This fantastical animated movie by cult filmmaker Ralph Bakshi finds the villainous Nekron and his mother, Queen Juliana, attacking the human race from their frigid fortress. Creating mass destruction with huge glaciers, Nekron and Juliana incur the wrath of Larn, a warrior whose entire village was destroyed by ice. When Nekron's underlings kidnap the beautiful Princess Teegra, Larn sets out to rescue her, assisted by the fierce and enigmatic Darkwolf.",
        "language": "en",
        "run_time": 4860,
        "title": "Fire and Ice",
        "tms_id": "MV000171070000",
        "year": 1983
    },
    {
        "description": "In the year 2274, young residents enjoy an idyllic, hedonistic lifestyle within the protective confines of a domed city. The general belief is that when each person turns 30, they are reincarnated for another blissful life cycle. Those who know the much darker truth become \"runners\" and flee to a hidden sanctuary. When law enforcement officer Logan (Michael York) goes undercover to locate the refuge, he winds up instead trying to initiate a revolution with runner Jessica (Jenny Agutter).",
        "language": "en",
        "run_time": 7080,
        "title": "Logan's Run",
        "tms_id": "MV000066420000",
        "year": 1976
    },
    {
        "description": "Two years ago, retired CIA agent Bryan Mills (Liam Neeson) used his \"particular set of skills\" to rescue his daughter, Kim (Maggie Grace), from kidnappers. Since then, Kim has been learning self-defense from her father, and Bryan has been on a personal mission to reunite with his ex-wife (Famke Janssen). In Istanbul, Bryan and his family cross paths with Murad (Rade Serbedzija), whose son died at Bryan's hand during Kim's rescue. Murad wants revenge, and he'll stop at nothing to get it.",
        "language": "en",
        "run_time": 5940,
        "title": "Taken II",
        "tms_id": "MV004441100000",
        "year": 2012
    },
    {
        "description": "A leprechaun (Warwick Davis) surfaces in Los Angeles to claim a bride, as his previous object of affection was denied to him a thousand years before in Ireland. He kidnaps teenager Bridget (Shevonne Durkin), grotesquely murdering anyone who gets in his way. It falls to Bridget's boyfriend, Cody (Charlie Heath), to rescue her. Cody enlists the aid of his perpetually tipsy uncle, Morty (Sandy Baron), who decides to go after the homicidal leprechaun's pot of gold.",
        "language": "en",
        "run_time": 5100,
        "title": "Leprechaun 2",
        "tms_id": "MV000391310000",
        "year": 1994
    },
    {
        "description": "A maverick hedge-fund manager from New York moves to Hong Kong to orchestrate a huge deal, which swiftly escalates out of his control.",
        "language": "en",
        "run_time": 6060,
        "title": "$upercapitalist",
        "tms_id": "MV004061210000",
        "year": 2012
    },
    {
        "description": "Just like her famous dad, Maya Dolittle can talk to the animals. When the President's unruly dog causes chaos, Maya is summoned to the White House to reason with the pesky pooch. She ends up getting involved with a matter of international importance.",
        "language": "en-GB",
        "run_time": 5400,
        "title": "Dr. Dolittle: Tail to the Chief",
        "tms_id": "MV002822520000",
        "year": 2008
    },
    {
        "description": "Successful and handsome New Yorker Brandon (Michael Fassbender) seems to live an ordinary life, but he hides a terrible secret behind his mask of normalcy: Brandon is a sex addict. His constant need for gratification numbs him to just about everything else. But, when Sissy (Carey Mulligan), Brandon's needy sister, unexpectedly blows into town, crashes at his apartment and invades his privacy, Brandon is finally forced to confront his addiction head-on.",
        "language": "en",
        "run_time": 5940,
        "title": "Shame",
        "tms_id": "MV003718670000",
        "year": 2011
    },
    {
        "description": "A Broadway star's (Jean Harlow) agent (William Powell) sees her through the scandal of her marriage to a drunken socialite (Franchot Tone).",
        "language": "en",
        "run_time": 5760,
        "title": "Reckless",
        "tms_id": "MV000122070000",
        "year": 1935
    },
    {
        "description": "Twelve fighters compete for money in a violent, no-holds-barred contest.",
        "language": "en",
        "run_time": 5700,
        "title": "Underground",
        "tms_id": "MV002271870000",
        "year": 2007
    },
    {
        "description": "After several years of living with a cult, Martha (Elizabeth Olsen) finally escapes and calls her estranged sister, Lucy (Sarah Paulson), for help. Martha finds herself at the quiet Connecticut home Lucy shares with her new husband, Ted (Hugh Dancy), but the memories of what she experienced in the cult make peace hard to find. As flashbacks continue to torment her, Martha fails to shake a terrible sense of dread, especially in regard to the cult's manipulative leader (John Hawkes).",
        "language": "en",
        "run_time": 6060,
        "title": "Martha Marcy May Marlene",
        "tms_id": "MV003566610000",
        "year": 2011
    },
    {
        "description": "A sweeping epic charting the early years of the Civil War and how the campaigns unfolded from Manassas I to the Battle of Fredericksburg, this prequel to the film \"Gettysburg\" explores the motivations of the combatants and examines the lives of those who waited at home.",
        "language": "en",
        "run_time": 13380,
        "title": "Gods and Generals",
        "tms_id": "MV001299330000",
        "year": 2003
    },
    {
        "description": "Several teenagers get stranded in the middle of a river on a houseboat, and an odd couple helps them get to shore, but that act of kindness disappears when the teens are chased through the forest by a brutal killer.",
        "language": "en",
        "run_time": 5400,
        "title": "The Mooring",
        "tms_id": "MV004578860000",
        "year": 2012
    },
    {
        "description": "When Will (Stuart Townsend) and Karen (Charlize Theron) Jennings are held hostage and their daughter is abducted, a relentless plan is set in motion that will challenge everything they took for granted. Joe (Kevin Bacon) and Cheryl (Courtney Love) Hickey, along with their cousin Marvin (Pruitt Taylor Vince), have orchestrated the foolproof plan to extort money from wealthy families. As the plan escalates and unravels, Will and Karen are pushed to the limit to get their daughter back alive.",
        "language": "en",
        "run_time": 6300,
        "title": "Trapped",
        "tms_id": "MV001186210000",
        "year": 2002
    },
    {
        "description": "Sexual experimentation links the lives of three high-school drama students (Emmy Rossum, Zach Gilford, Ashley Springer).",
        "language": "en",
        "run_time": 5400,
        "title": "Dare",
        "tms_id": "MV002568990000",
        "year": 2009
    },
    {
        "description": "Having rescued robot Johnny Five (Tim Blaney) from being destroyed by the military in \"Short Circuit,\" Indian scientist Ben Jahrvi (Fisher Stevens) moves to New York City to become an American citizen. After struggling to sell a few toy replicas of Johnny, Ben must scramble to make more when Sandy Banatoni (Cynthia Gibb) orders 1,000 for her department store. With Johnny's help, Ben begins making the gadgets, but his plans are endangered when thief Oscar Baldwin (Jack Weston) steals Johnny.",
        "language": "en",
        "run_time": 6600,
        "title": "Short Circuit 2",
        "tms_id": "MV000168050000",
        "year": 1988
    },
    {
        "description": "In Seattle during the era of grunge music, the lives and relationships of a group of young people, all living in the same apartment building, go through a period of flux. Among them are waitress and aspiring architect Janet (Bridget Fonda), who finds herself obsessed with bad boy musician Cliff (Matt Dillon) ; Linda (Kyra Sedgwick), an emotionally fragile environmentalist on the look-out for love; and Steve (Campbell Scott), a quintessential nice guy who studies traffic patterns.",
        "language": "en",
        "run_time": 5940,
        "title": "Singles",
        "tms_id": "MV000356040000",
        "year": 1992
    },
    {
        "description": "The filmmaker investigates technology in new cars.",
        "language": "en",
        "run_time": null,
        "title": "What is the Electric Car?",
        "tms_id": "MV003584880000",
        "year": 2010
    },
    {
        "description": "Widowed mother Mildred (Gena Rowlands) must suddenly redefine herself and find an outlet for her nurturing side when her adult daughter moves out of the family home. Though Mildred thinks she's found her purpose when her neighbor, overworked single mother Monica (Marisa Tomei), asks her to look after her little boy, J.J. (Jake Lloyd), she has great difficulty learning to strike a healthy balance between giving selflessly to others and remembering to take care of herself.",
        "language": "en",
        "run_time": 6180,
        "title": "Unhook the Stars",
        "tms_id": "MV000477420000",
        "year": 1996
    },
    {
        "description": "In Istanbul, retired CIA operative Bryan Mills and his wife are taken hostage by the father of a kidnapper Mills killed while rescuing his daughter.",
        "language": "en-GB",
        "run_time": 5520,
        "title": "Taken 2",
        "tms_id": "MV004561380000",
        "year": 2012
    },
    {
        "description": "After a spree of horrific murders in the New Mexico desert, two FBI agents arrive at a small Sante Fe police station to interview the key witnesses. Using elaborate surveillance equipment to view the interrogations simultaneously, Sam Hallaway watches as his partner cross examines the three survivors. As several inconsistencies emerge, it becomes clear that somebody in the room knows the truth behind the slayings.",
        "language": "en",
        "run_time": 5820,
        "title": "Surveillance",
        "tms_id": "MV002415760000",
        "year": 2008
    },
    {
        "description": "Vladimir Dracula III (Mike M. Burke) is blamed for deaths around his town, so he hires a lawyer to clear his name.",
        "language": "en",
        "run_time": 5580,
        "title": "Nosferatu's Crush",
        "tms_id": "MV004012810000",
        "year": 2006
    },
    {
        "description": "When King Richard the Lionheart is captured, his scheming brother Prince John (Claude Rains) plots to reach the throne, to the outrage of Sir Robin of Locksley (Errol Flynn), the bandit king of Sherwood Forest. Rounding up his band of men and eventually winning the support of the lovely Maid Marian (Olivia de Havilland), Robin accuses Prince John of treachery and, when the escaped Richard returns covertly to England, joins forces with the king to prevent Prince John from taking the crown.",
        "language": "en",
        "run_time": 6120,
        "title": "The Adventures of Robin Hood",
        "tms_id": "MV000014860000",
        "year": 1938
    },
    {
        "description": "Woody Harrelson and Juliette Lewis are two young, attractive serial killers who become tabloid-TV darlings, thanks to a sensationalistic press led by Robert Downey Jr. The press reports the pair as they go on a 52 people killing spree. A controversial look at the way the media portrays criminals.",
        "language": "en",
        "run_time": 7140,
        "title": "Natural Born Killers",
        "tms_id": "MV000400510000",
        "year": 1994
    },
    {
        "description": "Students unite to steal a famous painting and save their school from closure.",
        "language": "en",
        "run_time": 5820,
        "title": "St. Trinian's",
        "tms_id": "MV002152040000",
        "year": 2007
    },
    {
        "description": "Grotesque Freddy Krueger (Robert Englund) gives some more suburban teenagers something to dream about.",
        "language": "en",
        "run_time": 5580,
        "title": "A Nightmare on Elm Street 4: The Dream Master",
        "tms_id": "MV000254420000",
        "year": 1988
    },
    {
        "description": "In this sequel to \"A Man Called Horse,\" Lord John Morgan (Richard Harris) returns to the American West after feeling out of place in England. When he finds his Sioux friends who adopted him as one of their own, Morgan learns that white fur-trappers are murdering the Sioux and forcing them from their ancestral lands. While the Sioux initially believe that divine intervention will save their tribe, Morgan convinces them that the only way to regain their land is to fight back.",
        "language": "en",
        "run_time": 7740,
        "title": "The Return of a Man Called Horse",
        "tms_id": "MV000052270000",
        "year": 1976
    },
    {
        "description": "A hit-and-run driver (Zach Braff) causes a pregnant woman (Isabelle Blais) to lose her baby.",
        "language": "en",
        "run_time": 5520,
        "title": "The High Cost of Living",
        "tms_id": "MV003477240000",
        "year": 2010
    },
    {
        "description": "Things go very wrong when some friends follow a vehicle they've seen posted on an Amber Alert.",
        "language": "en",
        "run_time": 4800,
        "title": "Amber Alert",
        "tms_id": "MV004163650000",
        "year": 2012
    },
    {
        "description": "A couple of angels, O'Reilly (Holly Hunter) and Jackson (Delroy Lindo), are sent to Earth to make sure that their next supervised love-connection succeeds. They follow Celine (Cameron Diaz), a spoiled rich girl who has just accidentally shot a suitor (Stanley Tucci) and, due to a misunderstanding, is kidnapped by janitor Robert (Ewan McGregor). Although Celine quickly frees herself, she stays with Robert for thrills. O'Reilly and Jackson pursue, hoping to unite the prospective lovers.",
        "language": "en",
        "run_time": 6180,
        "title": "A Life Less Ordinary",
        "tms_id": "MV000524230000",
        "year": 1997
    },
    {
        "description": "A 12-year-old girl (Khomotso Manyaka) fights prejudice when her family is ostracized by a South African community.",
        "language": "en",
        "run_time": 6120,
        "title": "Life, Above All",
        "tms_id": "MV003252870000",
        "year": 2010
    },
    {
        "description": "Hollywood agent Jack Giamoro (Ben Affleck) has a ruthless dedication to his work and a tendency to neglect his wife, Nina (Rebecca Romijn). Upon discovering that Nina has been sleeping with an up-and-coming actor, Giamoro enrolls in a self-help course and begins keeping a diary. But, when that diary, with its tell-all account of Giamoro's professional and personal turmoil, falls into the hands of freelance writer Barbi Ling (Bai Ling), he struggles to retrieve it and prevent a massive scandal.",
        "language": "en",
        "run_time": 5820,
        "title": "Man About Town",
        "tms_id": "MV001677580000",
        "year": 2006
    },
    {
        "description": "Four diverse New York teenagers (Raven, Adrienne Bailon) hope their music group will hit the big time.",
        "language": "en",
        "run_time": 5580,
        "title": "The Cheetah Girls",
        "tms_id": "MV001380910000",
        "year": 2003
    },
    {
        "description": "In the 1970s, professor Herb Terrace and his team raise a baby chimp as a human child, as part of an experiment intended to break the language barrier between animals and people.",
        "language": "en",
        "run_time": 5940,
        "title": "Project Nim",
        "tms_id": "MV003542710000",
        "year": 2011
    },
    {
        "description": "In 1939 an all-black basketball team plays a competitive white team and helps usher in an era of creative energy known as the Harlem Renaissance.",
        "language": "en",
        "run_time": 5400,
        "title": "On the Shoulders of Giants",
        "tms_id": "MV003475700000",
        "year": 2011
    },
    {
        "description": "A hallucinating woman (Elke Sommer) flees to a mansion full of corpses and sees the devil (Telly Savalas) and other evil beings.",
        "language": "en",
        "run_time": 5580,
        "title": "Lisa and the Devil",
        "tms_id": "MV000003470000",
        "year": 1975
    },
    {
        "description": "As her brother stands trial for the killing of an outspoken New Orleans professor, inner-city schoolteacher Annie Tarrant (Kelly Rowan) begins hearing rumors of the Candyman (Tony Todd), a murderous, knife-handed figure of urban legend. Skeptical of the Candyman's existence, Annie follows the procedure for summoning him and suddenly finds herself celebrating the most horrifying Mardi Gras of her life. Meanwhile, Annie's mother (Veronica Cartwright) harbors a dark family secret.",
        "language": "en",
        "run_time": 5640,
        "title": "Candyman: Farewell to the Flesh",
        "tms_id": "MV000419080000",
        "year": 1995
    },
    {
        "description": "Orange picker Leroy Jones (Richard Pryor) inadvertently becomes a union leader and is forced out of town, leaving behind his sexually obsessed father, Rufus (also Pryor), and spouse, Annie Mae (Margaret Avery). He heads for Los Angeles, where he falls for union organizer Vanetta (Lonette McKee). Annie Mae seeks solace from the local preacher, Lenox Thomas (also Pryor), who eventually impregnates her. When Leroy catches wind of this, he heads home for a showdown with Lenox.",
        "language": "en",
        "run_time": 5640,
        "title": "Which Way Is Up?",
        "tms_id": "MV000013360000",
        "year": 1977
    }
]
