[
    {
        "description": "Successful, hardworking and unscrupulous, Jack (Affleck) is a Hollywood agent at the top of his game and completely out of kilter with his personal life. So he takes a self-help class and, when word gets out, becomes the focus of the gossip columns. Word travels fast...and so do the laughs.", 
        "id": 3154241, 
        "image_url": "http://ecx.images-amazon.com/images/I/51GPHviX9QL._SX320_SY240_.jpg", 
        "parsed_duration": 5940, 
        "title": "Man About Town", 
        "url": "http://www.amazon.com/dp/B000ODV1K6", 
        "year": 2006
    }, 
    {
        "description": "Lord John Morgan (Richard Harris) has returned to civilized life in England, but his disdain for the aristocracy inspires him to embrace the simplicity of the American West -- and the Yellow Hands Sioux tribe he left behind. When Morgan reaches the tribe's land, he discovers they've been decimated by ruthless, government-backed fur traders. Now, to help his friends survive, he must lead the fight to regain their land.", 
        "id": 229994609, 
        "image_url": null, 
        "parsed_duration": 7541, 
        "title": "The Return of a Man Called Horse", 
        "url": "http://www.netflix.com/WiPlayer?movieid=60020978", 
        "year": 1976
    }, 
    {
        "description": "Bare-knuckle brawler Philo Beddoe and his orangutan sidekick, Clyde, take on mobster fight promoters in this no-holds-barred comedy sequel to 'Every Which Way but Loose.' Clint Eastwood plays Philo and Ruth Gordon is his off-the-wall mother. But it's raunchy, rowdy Clyde who really steals the show!", 
        "id": 212758902, 
        "image_url": "http://i.max.lv3.maxgo.com/images/max/asset/1456/1456_888026_320x240.jpg", 
        "parsed_duration": 6939, 
        "title": "Any Which Way You Can", 
        "url": "http://www.maxgo.com/#home/video&assetID=MGOROSTGP31754?videoMode=embeddedVideo/", 
        "year": 1980
    }, 
    {
        "description": "Just after the death of her newly-born baby sister, Chanda, 12 years old, learns of a rumor that spreads like wildfire through her small, dust-ridden village near Johannesburg. It destroys her family and forces her mother to flee. Sensing that the gossip stems from prejudice and superstition, Chanda leaves home and school in search of her mother and the truth. MPAA Rating: PG-13 Rated PG-13 for mature thematic material and some sexual content. © 2010 Dreamer Joint Venture, Enigma Pictures, Senator Filmproduktion and Niama Film. All Rights Reserved.", 
        "id": 213539796, 
        "image_url": "http://i.ytimg.com/vi/NtvoCb89Nkk/movieposter.jpg", 
        "parsed_duration": 6346, 
        "title": "Life, Above All", 
        "url": "http://www.youtube.com/movie?v=NtvoCb89Nkk", 
        "year": 2011
    }, 
    {
        "description": "With his parents sliding toward divorce, the life of 6-year-old Jake (Anthony De Marco) begins to come apart. As he struggles to make sense of his evaporating home life, a friend (Matthew Josten) convinces Jake that something evil is lurking in his bedroom closet. But confronting the vile presence soon leads to an unnerving discovery in this taut thriller also starring Brooke Bloom, Sean Bridgers and Ben Bode.", 
        "id": 174803775, 
        "image_url": "http://cdn-0.nflximg.com/images/9184/1019184.jpg", 
        "parsed_duration": 5580, 
        "title": "Jake's Closet", 
        "url": "http://www.netflix.com/WiPlayer?movieid=70105690", 
        "year": 2007
    }, 
    {
        "description": "In her stunning feature film debut, Elizabeth Olsen delivers an electrifying, star-is-born performance in this gripping psychological thriller that is far and away one of the year's best! After escaping from a dangerous cult and the watchful eye of its charismatic leader (John Hawkes), a young woman named Martha (Olsen) tries to reclaim a normal life with her family.", 
        "id": 215525090, 
        "image_url": "http://images2.vudu.com/poster2/208000", 
        "parsed_duration": 6113, 
        "title": "Martha Marcy May Marlene", 
        "url": "http://www.vudu.com/movies/#!content/208000", 
        "year": 2011
    }, 
    {
        "description": "Following up the previous Nightmare film, dream deamon Freddy Krueger is resurrected from his apparent demise, and rapidly tracks down and kills the remainder of the Elm Street Kids.", 
        "id": 216916181, 
        "image_url": "http://www.cinemanow.com/images/boxart/175/a_nightmare_on_elm_street_aster_799d8ee0_175.jpg", 
        "parsed_duration": 5580, 
        "title": "A Nightmare on Elm Street 4: The Dream Master", 
        "url": "http://www.cinemanow.com/TitleDetail.aspx?grpid=10471&titleid=309314", 
        "year": 1988
    }, 
    {
        "description": "Spotlighting the all-black Harlem Renaissance basketball squad -- aka the Harlem Rens -- this film documents the segregated world of pro hoops during the 1930s and follows the Rens on their way to becoming pro basketball's first world champions.", 
        "id": 207963631, 
        "image_url": "http://cdn-1.nflximg.com/images/5845/1035845.jpg", 
        "parsed_duration": 4521, 
        "title": "On the Shoulders of Giants", 
        "url": "http://www.netflix.com/WiPlayer?movieid=70178565", 
        "year": 2011
    }, 
    {
        "description": "Vladimir Dracula III is a relative to the original Dracula of Transylvania. He lives in the US in the 21 century and has a big problem. First of all he is bald, has pointy elf like ears, fangs, he is very pale, hunched over, and can not get a woman to save his life! Secondly people are being attacked by vampires and the police think he is doing it. They have no evidence but continue to harass him. So Vlad decides to get a lawyer. That is when Rebekah arrives to represent him. Vlad falls madly in love with her, but with everything else in his life, another problem appears. Tony, her obnoxious, idiot boyfriend! Not only is he disrespectful to Rebekah, he wastes no time making fun of Vlad's appearance. Vlad is not the only vampire in town. He lives with three beautiful vampire women who find victims for him. He doesn't like to attack any more so they do it for him. Meanwhile an evil vampire, who sneaks around the woods at night attacking people, makes it look like Vlad is the attacker. Vlad fights his hardest to get Rebekah but will have to fight even harder when Rebekah is eyed by the Evil Vampire Woman and must face trouble from a jealous Tony. Will he get the girl of his dreams? Will he prove his innocence? Will he stop the vicious vampire? Will he save the one he loves before it is too late? Will he grow hair? Find out in the very funny and spooky Nosferatu's Crush Special features include behind the scenes, outtakes, mocumentary,and more...", 
        "id": 221296829, 
        "image_url": "http://ecx.images-amazon.com/images/I/310ll2dGJUL._SX320_SY240_.jpg", 
        "parsed_duration": 5580, 
        "title": "Nosferatu's Crush", 
        "url": "http://www.amazon.com/dp/B0089624HO", 
        "year": null
    }, 
    {
        "description": "Emmy Rossum (The Phantom of the Opera), Zach Gilford (TV's Friday Night Lights) and Ashley Springer (Teeth) head up a stellar cast including Ana Gasteyer (Mean Girls), Rooney Mara (A Nightmare on Elm Street), comedienne Sandra Bernhard (TV's Roseanne) and Alan Cumming (X2: X-Men United) in this captivating story of high school seniors at the crossroads of their adult lives. When a pompous actor tells good girl Alexa (Rossum) that she hasn't lived, she embarks on a bold journey that takes her to mysterious bad boy Johnny (Gilford). Envious, her shy best friend Ben (Springer) also dares to pursue Johnny, complicating Alexa's romance and pushing the boundaries among the three friends.", 
        "id": 195162802, 
        "image_url": "http://ecx.images-amazon.com/images/I/51E4X6PSZAL._SX320_SY240_.jpg", 
        "parsed_duration": 5460, 
        "title": "Dare", 
        "url": "http://www.amazon.com/dp/B0037UN5BG", 
        "year": null
    }, 
    {
        "description": "One of special-effects wizard Ray Harryhausen's pre-Seventh Voyage of Sinbad efforts, 20 Million Miles to Earth borrows a few pages from King Kong. An American spaceship crashlands off the coast of Sicily. The rescue party discovers that the astronauts have inadvertently brought back a curious gelatinous mass from the planet Venus. This lump of goo rapidly evolves into be a living reptilian creature, which scientists label an \"Ymir\". While being subjected to laboratory experimentation, the Ymir begins growing by leaps and bounds, and before long the gigantic monstrosity has escaped and is wreaking havoc in Rome. After battling a zoo elephant and taking a swim in the Tiber, the gargantuan creature holes up in the Colosseum, where the film's pyrotechnic finale occurs.", 
        "id": 229782068, 
        "image_url": "http://i.ytimg.com/vi/BCwWJR8t1eI/movieposter.jpg", 
        "parsed_duration": 4971, 
        "title": "20 Million Miles to Earth", 
        "url": "http://www.youtube.com/movie?v=BCwWJR8t1eI", 
        "year": 1957
    }, 
    {
        "description": "THE ULTIMATE WAVE TAHITI plunges you into the stunning beauty of an island paradise on a quest to find the perfect wave-riding experience. Ten-time world surfing champion Kelly Slater and Tahitian surfer Raimana Van Bastolaer and a group of friends seek out the best waves breaking on the reef at Tahiti's famed surf site Teahupo'o. As their quest unfolds, you are plunged beneath the surface of things, to explore the hidden forces at work shaping ocean waves and the islands that lie in their path.", 
        "id": 204027470, 
        "image_url": "http://ecx.images-amazon.com/images/I/51BuRs-nfcL._SX320_SY240_.jpg", 
        "parsed_duration": 2760, 
        "title": "The Ultimate Wave: Tahiti", 
        "url": "http://www.amazon.com/dp/B004WMKHPK", 
        "year": null
    }, 
    {
        "description": "Richard Pryor plays three rolesa farm worker named Leroy Jones; his father, Rufus; and the preacher Rev. Lenox Thomasin this outrageous comedy about too many women and too little time.", 
        "id": 216905143, 
        "image_url": "http://cache.roxionow.com/images/boxart/269/which_way_is_up_299c5e81_269.jpg", 
        "parsed_duration": 5700, 
        "title": "Which Way is Up?", 
        "url": "http://www.cinemanow.com/title/396365", 
        "year": 1977
    }, 
    {
        "description": "Fabrice is a big - perhaps the biggest - fan of Jean-Philippe Smet, better known as Johnny Hallyday, the greatest rocker France has ever produced. But one day Fabrice wakes up in a parallel world where Johnny doesn't exist. Fabrice becomes obsessed with the idea of putting his idol back on his pedestal, where he belongs. He finds Jean-Philippe running a bowling alley. They have 40 lost years of Johnny to make up,but one thing is sure... It's never too late to change your destiny!", 
        "id": 111422698, 
        "image_url": "http://ecx.images-amazon.com/images/I/61VS39IHafL._SX320_SY240_.jpg", 
        "parsed_duration": 5880, 
        "title": "Jean Philippe", 
        "url": "http://www.amazon.com/dp/B001J4C0EU", 
        "year": 2006
    }, 
    {
        "description": "Maya Dolittle (Kyla Pratt) is back in a heartwarming adventure of presidential proportions! Maya’s dream of going to vet school is put on hold when she gets a call from the President of the United States. It seems the First Dog is out of control and the President needs her help. It’s up to Maya and her own dog, Lucky, to stop a canine catastrophe from becoming a national crisis!", 
        "id": 229850836, 
        "image_url": null, 
        "parsed_duration": 5258, 
        "title": "Dr. Dolittle: Tail to the Chief", 
        "url": "https://itunes.apple.com/gb/movie/dr.-dolittle-tail-to-the-chief/id275098863", 
        "year": 2008
    }, 
    {
        "description": "They come trained in different disciplines including kickboxing, gung fu, tae kwon do, freestyle, ninjitsu, mixed martial arts, karate, wushu, boxing, wrestling, shaolin, ngor chor and capoeira, and are handpicked to compete for a one million dollar prize in a no-holds-barred competiton...and even a fight to the death.", 
        "id": 110578875, 
        "image_url": "http://ecx.images-amazon.com/images/I/51ggxcx6vtL._SX320_SY240_.jpg", 
        "parsed_duration": 5460, 
        "title": "Underground", 
        "url": "http://www.amazon.com/dp/B001CRX3KY", 
        "year": null
    }, 
    {
        "description": "\"Welcome to Sherwood Forest!\" Errol Flynn (\"Gentleman Jim,\" \"Captain Blood\") stars as the famed bandit king of Sherwood Forest who romances Maid Marian and leads his Merry Men in a battle against the corrupt Prince John. Co-starring Oscar-nominee Basil Rathbone (\"Romeo and Juliet\"), Oscar-winner Olivia De Havilland (\"Gone with the Wind,\" \"To Each His Own\") and Oscar-nominee Claude Rains (\"Casablanca\" \"Mr. Smith Goes to Washington). Nominated for four Academy Awards (including Best Picture) and winner of three. Selected by the prestigious American Film Institute as one of the 400 best American films and listed Robin Hood one of the 50 Greatest Heroes of all time. Inducted into the Library of Congress National Film Registry.", 
        "id": 229688546, 
        "image_url": null, 
        "parsed_duration": 6115, 
        "title": "The Adventures of Robin Hood (1938)", 
        "url": "https://itunes.apple.com/ca/movie/adventures-robin-hood-1938/id284932343", 
        "year": 1938
    }, 
    {
        "description": "Uncompromising, dark satire of America's fascination with violence via two lovers/killers and the media machine that makes them folk heroes. With Robert Downey, Jr,, Tommy Lee Jones, directed by Oliver Stone.", 
        "id": 210622056, 
        "image_url": "http://xfinitytv.comcast.net/api/entity/thumbnail/Movie-39748/640/320", 
        "parsed_duration": 7153, 
        "title": "Natural Born Killers [Esp dub]", 
        "url": "http://xfinitytv.comcast.net/movies/Natural-Born-Killers/39748/2035909666/Natural-Born-Killers-%5BEsp-dub%5D/videos?cmpid=syn_rss", 
        "year": null
    }, 
    {
        "description": "Zach Braff and Isabelle Blais star in this thought provoking drama about two lives that randomly collide with tragic consequences forcing them to confront loss, love and life and decide if the high cost of living is worth the price.", 
        "id": 212563036, 
        "image_url": "http://images2.vudu.com/poster2/194249", 
        "parsed_duration": 5840, 
        "title": "The High Cost of Living", 
        "url": "http://www.vudu.com/movies/#!content/194249", 
        "year": 2010
    }, 
    {
        "description": "A group of tourists are drawn into a nightmare after their car breaks down near a Spanish villa. Lisa (Elke Sommer) and others are invited to spend the night at a mysterious mansion. The mansions unique occupants all seem to be living in a very distant past. As the evening progresses, the atmosphere takes its toll on the tired travelers. A dark cloud hands over each of their heads as one by one, they all succumb to jealousy, hatred and eventually death. Could the butler (Telly Savalas) be the incarnation of the Devil himself, only those who survive can tell. A.K.A.: Diablo se lleva a los muertos, El, Diavolo e i morti, Il, Lisa e il diavolo, Teuflische, others. REDUCED 7/12", 
        "id": 186653292, 
        "image_url": "http://ecx.images-amazon.com/images/I/51wXdhbjUXL._SX320_SY240_.jpg", 
        "parsed_duration": 5760, 
        "title": "LISA AND THE DEVIL", 
        "url": "http://www.amazon.com/dp/B00380U42I", 
        "year": null
    }, 
    {
        "description": "Meet The Cheetah Girls, four New York teens facing the challenges of growing up as they dance and sing their way toward that elusive record deal. Raven (That's So Raven) stars alongside Adrienne Bailon and Kiely Williams, and Sabrina Bryan. As the girls are gearing up to rehearse for the school talent competition, they're discovered by famous record producer Jackal Johnson. But the feisty foursome soon learns that their big break is not what they expected. Jackal wants to remake them into something they're not. Ultimately, the path to stardom challenges their friendship and the girls must find a way to come together in order to achieve their dreams. Packed with hot songs and cool moves, these darling divas steal the show in this hit Disney Channel movie.", 
        "id": 223225618, 
        "image_url": "http://i.ytimg.com/vi/FeQYAr_kx_Q/movieposter.jpg", 
        "parsed_duration": 5587, 
        "title": "The Cheetah Girls", 
        "url": "http://www.youtube.com/movie?v=FeQYAr_kx_Q", 
        "year": 2003
    }, 
    {
        "description": "When a fanatical education minister threatens to close St. Trinian's school because of its bad reputation and dire financial straits, the student body -- which consists of a gaggle of devilish girls -- plans a heist worthy of a million detentions.", 
        "id": 219180615, 
        "image_url": "http://cdn-0.nflximg.com/images/0651/1000651.jpg", 
        "parsed_duration": 6053, 
        "title": "St. Trinian's", 
        "url": "http://www.netflix.com/WiPlayer?movieid=70119190", 
        "year": 2007
    }, 
    {
        "description": "A sweeping epic charting the early years of the Civil War and how campaigns unfolded from Manassas to the Battle of Fredericksburg, this prequel to the film Gettysburg explores the motivations of the combatants and examines the lives of those who waited at home.", 
        "id": 186609328, 
        "image_url": "http://ecx.images-amazon.com/images/I/51qV6D5n2LL.jpg", 
        "parsed_duration": 13140, 
        "title": "Gods and Generals", 
        "url": "http://www.amazon.com/dp/B004F8FOOK", 
        "year": 2003
    }, 
    {
        "description": "Hilarious, gritty and fully loaded with intense action, Cat Run stars Paz Vega (Spanglish) as a high-end call girl on the run for her life. With key evidence to the scandalous government cover-up of a shockingly horrific crime, she must rely on two bumbling private detectives (Scott Mechlowicz, Alphonso McAuley) to be her unlikely protectors from a deadly combination of the Mob, a corrupt US senator and a ruthlessly sadistic female assassin (Janet McTeer, Tumbleweeds) - all of whom will stop at nothing to hide the truth. This stylish, sexy, fast-moving action thrill ride is directed by John Stockwell (Crazy/Beautiful).", 
        "id": 222071544, 
        "image_url": "http://ecx.images-amazon.com/images/I/51tv2FpK1DL._SX320_SY240_.jpg", 
        "parsed_duration": 6420, 
        "title": "Cat Run", 
        "url": "http://www.amazon.com/dp/B008CP9M54", 
        "year": 2011
    }, 
    {
        "description": "A pair of FBI agents sets up separate interviews for three survivors of a roadside desert massacre, then must determine the truth from the conflicting reports in this sly comic thriller.", 
        "id": 203916679, 
        "image_url": "http://media4.comcast.net/odol/ODOL_Showtime/743/233/0_0_136320_02_640x320.jpg", 
        "parsed_duration": 5848, 
        "title": "Surveillance", 
        "url": "http://xfinitytv.comcast.net/movies/Surveillance/145305/1852023115/Surveillance/videos?cmpid=syn_rss", 
        "year": null
    }, 
    {
        "description": "In a hermetically sealed, post-apocalyptic urban environment several centuries hence, Logan 5 (Michael York) and his friend Francis 7 (Richard Jordan) lead unquestioning lives of hedonism. Entertainment comes in the form of casual sexual liaisons and gladiatorial games in which those who do not wish to undergo euthanasia at the age of 30 vie for the illusory chance of continued life. As \"sandmen,\" Logan and Francis are charged with tracking down and killing \"runners\" -- those citizens who will submit to neither \"renewal\" (a peaceful death) nor \"carousel\" (a gladiatorial battle) when their time comes. When Logan grows intrigued by a beautiful young woman, Jessica 6 (Jenny Agutter), who plans to become a runner, he is forced to question the fundamental principles of his society. And when his superiors force him to pose as a runner himself to weed out Jessica's guerilla underground, Logan finds himself fleeing the city in search of a mythical place called Sanctuary where people are allowed to live out their natural spans. ~ Brian J. Dillard, Rovi", 
        "id": 185884701, 
        "image_url": "http://images.blockbuster.com/is/amg/dvd/cov150/dru500/u504/u50474i5w27.jpg?wid=130&hei=182&align=-1,-1", 
        "parsed_duration": null, 
        "title": "Logan's Run", 
        "url": "http://www.blockbuster.com/browse/catalog/movieDetails/20816", 
        "year": 1976
    }, 
    {
        "description": "A maverick New York hedge fund trader with uncanny analytic abilities is sent to Hong Kong to orchestrate a mega-deal that swiftly gets out of his control.", 
        "id": 224661333, 
        "image_url": "http://images2.vudu.com/poster2/343337", 
        "parsed_duration": 6113, 
        "title": "Supercapitalist", 
        "url": "http://www.vudu.com/movies/#!content/343337", 
        "year": 2012
    }, 
    {
        "description": "Hobbs, a notorious wanted bandit, gets caught up in a violently competitive hunt for stolen cash when he finds out outlaws have robbed the local bank. While trying to get back what's his, he must saddle up to stop these outlaws, leaving whoever stands in his way dead!", 
        "id": 213164809, 
        "image_url": "http://ecx.images-amazon.com/images/I/510Fkx1c%2BLL._SX320_SY240_.jpg", 
        "parsed_duration": 5760, 
        "title": "The Righteous & The Wicked", 
        "url": "http://www.amazon.com/dp/B0067XOCQC", 
        "year": 2011
    }, 
    {
        "description": "Aspiring Broadway actress Mona Leslie has two rivals for her affections: Ned Riley, a humble sports promoter, and millionaire playboy Bob Harrison.", 
        "id": 203916299, 
        "image_url": "http://media4.comcast.net/odol/ODOL_indemand/708/197/reckless_54x36_vu_.jpg", 
        "parsed_duration": 5826, 
        "title": "Reckless", 
        "url": "http://xfinitytv.comcast.net/movies/Reckless/14282/1815285827/Reckless/videos?cmpid=syn_rss", 
        "year": null
    }, 
    {
        "description": "White Wash, the documentary, is a film exploring the complexity of race in America through the eyes of the ocean. Examining the history of \"black consciousness\" as it triumphs and evolves into the minds of black surfers, we learn the power of transcending race as a constructive phenomenon. The story is narrated by the legendary, Grammy Award® winner Ben Harper (Fistful of Mercy, Relentless 7, Ben Harper and the Innocent Criminals) along with Tariq \"Blackthought\" Trotter of the Grammy Award® winning hip hop group, The Roots whom also originally scored the film.", 
        "id": 214390013, 
        "image_url": null, 
        "parsed_duration": 4648, 
        "title": "White Wash", 
        "url": "https://itunes.apple.com/us/movie/white-wash/id471388549", 
        "year": 2011
    }, 
    {
        "description": "Acclaimed filmmaker Neil LaBute (\"In the Company of Men\") directs Academy Award-winner Nicolas Cage (\"National Treasure,\"\"Matchstick Men\") in this spine-tingling remake of the 1970s British cult classic horror film. Cage plays a police officerinvestigating the disappearance of a young girl on a remote island off the coast of Washington. His hopes of unraveling the mysteryof the girls unsettling disappearance become increasingly uncertain however, when he unearths disturbing evidence of pagan ritualsbeing performed in the small, cult-like community. With the help of a frightened local (Golden Globe-nominee Leelee Sobieski --\"Uprising,\" \"Eyes Wide Shut\"), he must confront the island's horrific secret, and its other-worldly leader (Academy Award and GoldenGlobe-winner, Ellen Burstyn -- \"Divine Secrets of the Ya-Ya Sisterhood,\" \"Requiem for a Dream\"). Also starring Golden Globe-winnerFrances Conroy (TV's \"Six Feet Under,\" \"The Aviator\") and Molly Parker (TV's \"Deadwood\").", 
        "id": 110320436, 
        "image_url": "http://ecx.images-amazon.com/images/I/51lbhCxJfIL._SX320_SY240_.jpg", 
        "parsed_duration": 6180, 
        "title": "The Wicker Man (Rated)", 
        "url": "http://www.amazon.com/dp/B000MS201M", 
        "year": 2006
    }, 
    {
        "description": "From the Oscar®-winning team behind MAN ON WIRE comes the story of Nim, the chimpanzee who became the focus of a landmark 1970s experiment to show that an ape could learn to communicate with language if raised and nurtured like a human child. But as Nim's natural instincts take over and the humans around him fail to protect him, PROJECT NIM uncovers the unflinching and extraordinary journey of one animal thrust into human society.", 
        "id": 217248445, 
        "image_url": "http://i.ytimg.com/vi/NRLfC09bFYk/0.jpg", 
        "parsed_duration": 5980, 
        "title": "Project Nim", 
        "url": "http://www.youtube.com/movie?v=NRLfC09bFYk", 
        "year": 2011
    }, 
    {
        "description": "Gena Rowlands and Academy Award winner Marisa Tomei (Best Supporting Actress, My Cousin Vinny, 1993) team up in this critically-acclaimed comedy treat! Mildred (Rowlands) is a quiet suburban lady whose life is changed forever when she agrees to baby-sit for Monica, her wild and crazy neighbor (Tomei). As Mildred, a caretaker by nature, grows closer to Monica's son, J.J. (Jake Lloyd), he thrives under her watchful eye - and Mildred begins to loosen up with the help of Monica's party-girl ways. But when Monica sorts out her domestic issues, and J.J. no longer needs a babysitter, Mildred is forced to examine her life and for once, focus her energy on herself.", 
        "id": 228953028, 
        "image_url": "http://images2.vudu.com/poster2/26346", 
        "parsed_duration": 6308, 
        "title": "Unhook the Stars", 
        "url": "http://www.vudu.com/movies/#!content/26346", 
        "year": 1996
    }, 
    {
        "description": "After one son foils a criminal gang's attempt to steal a priceless Thai artifact, his family becomes national heroes and the target of revenge.", 
        "id": 229935607, 
        "image_url": "http://images2.vudu.com/poster2/424414", 
        "parsed_duration": 5637, 
        "title": "The Kick", 
        "url": "http://www.vudu.com/movies/#!content/424414", 
        "year": 2011
    }, 
    {
        "description": "A janitor in L.A. takes his boss's daughter hostage after being fired and replaced by a robot. Two \"angels\" who are in charge of human relationships on earth, offer some unsolicited help to bring this unlikely couple together. The \"angels\" are so successful that the daughter soon turns on her father in order to save her captor.", 
        "id": 110537544, 
        "image_url": "http://ecx.images-amazon.com/images/I/511EUoT79hL._SX320_SY240_.jpg", 
        "parsed_duration": 6240, 
        "title": "A Life Less Ordinary", 
        "url": "http://www.amazon.com/dp/B000I9VYXU", 
        "year": 1997
    }, 
    {
        "description": "Albanians in Istanbul, to avenge the death of a leader's son, kidnap a retired CIA agent and his Ex-Wife. After their teenage daughter helps them escape, the agent kills the head Albanian.", 
        "id": 229095546, 
        "image_url": "http://images2.vudu.com/poster2/400336", 
        "parsed_duration": 5896, 
        "title": "Taken 2 (Unrated)", 
        "url": "http://www.vudu.com/movies/#!content/400336", 
        "year": 2012
    }, 
    {
        "description": "When a group of friends decides to follow a car they've seen posted on an Amber Alert, things start to go very wrong.", 
        "id": 226686047, 
        "image_url": "http://cache.roxionow.com/images/boxart/269/amber_alert_0da2e4f3_269.jpg", 
        "parsed_duration": 4800, 
        "title": "Amber Alert", 
        "url": "http://www.cinemanow.com/title/469848", 
        "year": 2012
    }, 
    {
        "description": "A thousand years ago, the Leprechaun (Warwick Davis) left a bloody trail when he ripped through the countryside in search of his stolen pot of gold. Now he's back in the big city using all of his deadly tricks to snare the girl of his nightmares. His bloody quest becomes more deadly when her boyfriend steals one of the Irish monster's precious gold coins. The town soon discovers two dead bodies and a trail of gold dust leads them to the Leprechaun's lair. It's a pot full o'blood, guts and horror as the Leprechaun goes on a wild rampage filled with grisly thrills and gruesome special effects.", 
        "id": 211838715, 
        "image_url": "http://images2.vudu.com/poster2/6134", 
        "parsed_duration": 5101, 
        "title": "Leprechaun 2", 
        "url": "http://www.vudu.com/movies/#!content/6134", 
        "year": 1994
    }, 
    {
        "description": "Seeking financial independence, rebellious teen Dorian and his serious new friend, Grace, go into business selling pot. But when business gets complicated, so do their lives, as both Grace and Dorian find themselves dealing with issues from the past.", 
        "id": 185768145, 
        "image_url": "http://cdn-1.nflximg.com/images/8214/998214.jpg", 
        "parsed_duration": 5700, 
        "title": "Middle of Nowhere", 
        "url": "http://www.netflix.com/WiPlayer?movieid=70108563", 
        "year": 2008
    }, 
    {
        "description": "The Electric Vehicle is a booming industry. EVs are 400% more efficient than gas cars. Watch Interviews with manufacturers and drivers. Visit the Petersen and Ford Museums, Jay Leno's Garage and the Detroit Auto Show. A documentary for, not only \"Green\" enthusiasts, but for anyone who drives.", 
        "id": 215572272, 
        "image_url": null, 
        "parsed_duration": 4560, 
        "title": "What is the Electric Car", 
        "url": "http://www.amazon.com/dp/B007DDM8U2", 
        "year": null
    }, 
    {
        "description": "Annie Tarrant uncovers the terrifying secrets of her family's past which link her to the Candyman in a way she would never dare imagine. Carelessly repeating his name five times, The Candyman makes a horrifying appearance, wreaking mayhem and brutal murder in his wake. Will Anne survive the evil return of the Candyman?", 
        "id": 211831682, 
        "image_url": "http://images2.vudu.com/poster2/140568", 
        "parsed_duration": 5705, 
        "title": "Candyman: Farewell to the Flesh", 
        "url": "http://www.vudu.com/movies/#!content/140568", 
        "year": 1995
    }, 
    {
        "description": "Liam Neeson returns as Bryan Mills, the ex-CIA operative who stopped at nothing to rescue his daughter from sadistic kidnappers. When the father of one of the kidnappers swears revenge, it is Bryan and his wife who find themselves \"taken\" hostage in Istanbul. To survive, Bryan must enlist the help of an unlikely ally and use his brutally efficient skills to take out his heavily-armed foes one by one.", 
        "id": 229782377, 
        "image_url": "http://i.ytimg.com/vi/PALki6zkvP8/movieposter.jpg", 
        "parsed_duration": 5469, 
        "title": "Taken 2", 
        "url": "http://www.youtube.com/movie?v=PALki6zkvP8", 
        "year": 2012
    }, 
    {
        "description": "A group of teenage girls attend a summer camp in rural Idaho to connect with nature. But when their houseboat is suddenly stranded on a river, their vacation takes a deadly turn as the girls find themselves on the run from a brutal and determined killer.", 
        "id": 229339669, 
        "image_url": "http://ecx.images-amazon.com/images/I/51MklOU-dOL._SX320_SY240_.jpg", 
        "parsed_duration": 5400, 
        "title": "The Mooring", 
        "url": "http://www.amazon.com/dp/B00B4PY3A8", 
        "year": 2013
    }, 
    {
        "description": "An internet security expert is forced by a mysterious kidnapper to hack into the FBI's database as part of his plan to kill a woman in the Witness Protection Program.", 
        "id": 215543895, 
        "image_url": "http://xfinitytv.comcast.net/api/entity/thumbnail/6823829736174930112/640/320", 
        "parsed_duration": 6348, 
        "title": "Trapped", 
        "url": "http://xfinitytv.comcast.net/watch/Trapped/6823829736174930112/2193373452/Trapped/videos?cmpid=syn_rss", 
        "year": 2002
    }, 
    {
        "description": "Driven by a brilliant and ferocious performance by Michael Fassbender, Shame tells the riveting story of Brandon; a handsome New York businessman with a dark and destructive secret. His solitary existence is shaken by the unexpected arrival of his sister Sissy (Carey Mulligan, An Education), another damaged soul who brings memories of a painful shared past. Graphic, highly provocative and undeniably powerful, Shame is a devastating and thought-provoking cinematic experience.", 
        "id": 218429448, 
        "image_url": "http://ecx.images-amazon.com/images/I/51iAA5n6VoL._SX320_SY240_.jpg", 
        "parsed_duration": 6120, 
        "title": "Shame", 
        "url": "http://www.amazon.com/dp/B007UXTG8M", 
        "year": 2011
    }, 
    {
        "description": "Celebrated sword-and-sorcery artist Frank Frazetta teams up with animation director Ralph Bakshi for this high-energy animated fantasy. It's a prehistoric battle of the elements as the dissolute ruler of the Ice World, Nekron (Sean Hannon), starts a war against the fire people using a massive, advancing glacier and armies of subhuman monsters as his weapons. When he arranges to have the fire king's shapely daughter, Teegra (Cynthia Lenke), kidnapped, the adventure begins as she escapes her captors and hooks up with Lorn (Randy Norton), lone survivor of an earlier skirmish. With the aid of a mysterious dark warrior (based on Frazetta's famous painting \"The Death Dealer\"), Lorn and Teegra fight the armies of Nekron as well as giant monsters, lesbian sorcerers, and other comic book delights. A thunderous classical score by William Kraft adds excitement to this violent, sexy, fast-moving film. It also benefits from unusual animation techniques that nicely complement the far-out imaginations of Frazetta, Bakshi, and screenwriters Roy Thomas and Gerry Conway.", 
        "id": 212585834, 
        "image_url": "http://ecx.images-amazon.com/images/I/514wH45Al-L._SX320_SY240_.jpg", 
        "parsed_duration": 4920, 
        "title": "Fire and Ice", 
        "url": "http://www.amazon.com/dp/B005YVQH6G", 
        "year": 1983
    }, 
    {
        "description": "Bridget Fonda, Matt Dillon, Kyra Sedgwick and Campbell Scott in an\"exuberant romantic comedy\" (Rolling Stone) about Seattle twenty-somethings searching for-and running from-love. Bonus: Two outakescenes.", 
        "id": 110309744, 
        "image_url": "http://ecx.images-amazon.com/images/I/41g38-Lk4iL._SX320_SY240_.jpg", 
        "parsed_duration": 6000, 
        "title": "Singles", 
        "url": "http://www.amazon.com/dp/B0014DU3HC", 
        "year": 1999
    }, 
    {
        "description": "Set in a 19th century European village, this stop-motion, animated feature follows the story of Victor, a young man who is whisked away to the underworld and wed to a mysterious Corpse Bride.", 
        "id": 35672283, 
        "image_url": null, 
        "parsed_duration": 4632, 
        "title": "Tim Burton's Corpse Bride", 
        "url": "https://itunes.apple.com/us/movie/tim-burtons-corpse-bride/id284480125", 
        "year": 2005
    }, 
    {
        "description": "Mark Wahlberg stars as legendary smuggler Chris Farraday, who has left his criminal past behind to be with his wife (Kate Beckinsale) and sons. When a ruthless drug kingpin (Giovanni Ribisi) threatens his family, Farraday must summon his old skills and contacts for one last run. Contraband takes you to the cutthroat underground world of international smuggling, and on a thrilling adventure that critics are calling \"dynamic, intense and gritty!\" - Mark S Allen, CBS/CW-TV (Sacramento)", 
        "id": 218192614, 
        "image_url": "http://ecx.images-amazon.com/images/I/512c3L6hJNL._SX320_SY240_.jpg", 
        "parsed_duration": 6600, 
        "title": "Contraband", 
        "url": "http://www.amazon.com/dp/B007RFJ4QM", 
        "year": 2012
    }, 
    {
        "description": "High-voltage, fast-paced comedy for the entire family. Number Five, A.K.A. Johnny Five, that incredible lovable robot, is back and taking the big city by storm. More \"human\" than ever, upbeat Johnny's out for some \"urban input\", but some street hoods see his innocence as their high-tech ticket to easy street.", 
        "id": 110537826, 
        "image_url": "http://ecx.images-amazon.com/images/I/51%2B1PNbPYYL._SX320_SY240_.jpg", 
        "parsed_duration": 6660, 
        "title": "Short Circuit 2", 
        "url": "http://www.amazon.com/dp/B000ZHB6Q0", 
        "year": 1988
    }
]
